МАСИВИ
---------------------------------------------------------

1.	Задача Да се състави програма, която въвежда оценките на един ученик и пресмята средния му успех. Първо да се въведе броят на оценките, а след това и самите оценки разделени с интервал. В масива може да има най-много 50 елемента.
Пример:
Вход:
4
6 4 5 6
Изход:
5.25
________________________________________

2.	Задача Да се състави програма, която извежда сумата от положителните и броя на отрицателните елементи на редицата от реални числа а1, а2, …, аn (0 < n < 24).
________________________________________


3.	Задача Да се състави програма, която пресмята сумата: a0b0 + a1b1 + … + an-1bn-1, където (а0, а1, …, аn-1) и (b0, b1, …, bn-1) са два дадени едномерни масива от числен тип (1 < n < 50) .
________________________________________


4.	Задача Да се състави програма, която въвежда n реални числа и извежда минималното и максималното от тях (0 < n < 50).
________________________________________


5.	Задача Да се състави програма, която намира максималния елемент в даден масив, а също и неговия пореден номер.
________________________________________


6.	Задача Дадени са сортирани във възходящ ред редици а0,а1, а2, …, аk и b0, b1, …, bk. Да се състави програма, която намира броя на равенствата от вида
ai = bj (i =1, 2, .., k, j = 1,2, …, k, 0<=k<=100).
________________________________________


7.	Задача Дадени са редицата от цели числа а0, а1, …, аn-1 (0 < n < 50) и цяло число х. Да се състави прог¬рама, която намира колко пъти х се съдържа в ре¬дицата.
________________________________________


8.	Задача Дадени са редицата от цели числа а0, а1, а2, …, аn-1 (0< n < 100) и цяло число х. Да се състави прог¬рама, която проверява дали х се съдържа в реди¬цата а0, а1, а2, …, аn-1 (последователно търсене).
________________________________________


9.	Задача Да се състави програма, която установява дали редицата от цели числа а0, а1, а2, …, аn-1 е монотонно намаляваща (0 < n < 50) .
________________________________________


10.	Задача Да се състави програма, която установява дали редицата от цели числа а0, а1, а2, …, аn-1 се състои от различни елементи (0 < n < 50) .
________________________________________


11.	Задача Даден е масив от тип char съдържащ n символа (0 < n < 50) . Да се състави програма, която определя дали масива е симетричен, т.е. прочетен отляво надясно и отдясно наляво е един и същ.
________________________________________


12.	Задача Да се състави програма, която проверява, има ли в редицата от цели числа а0, а1, а2, …, аn-1 (0 < n < 51) два последователни нулеви елемента.
________________________________________


13.	Задача Дадена са редицата от реални числа а0, а1, а2, …, аn-1 (0 < n < 51) . Да се състави програма, която сортира във възходящ ред елементите на редицата.
________________________________________


14.	Задача Нека А е сортиран във възходящ ред масив от елементи а0, а1, а2, …, аn-1 (0 < n < 51). Да се състави програма, която установява дали елемента х се съдържа в масива (двоично търсене).
________________________________________


15.	Задача Дадени са два сортирани масива съответно с N и M числа. Слейте ги в нов сортиран масив.
Пример:
Вход:
5
1 3 6 7 8

7
2 4 5 7 9 11 12
Изход:
1 2 3 4 5 7 7 8 9 11 12
________________________________________


16.	Задача Въведено е число a. Да се изведе неговия двоичен запис.
Ограничения: Двоичният запис на числото няма да съдържа повече от 20 знака
Пример:
Вход:
123
Изход:
1111011
________________________________________
Решение


17.	Задача Дадено е число N (с не повече от 12 цифри). Да се провери дали цифрите му образуват палиндром.
Пример:
Вход:
1987891
Изход:
Yes
________________________________________


18.	Задача Дадени са N на брой цели положителни числа разположени в кръг (т.е последното и първото са съседи) и число K, такова че N и K са взаимно прости (т.е нямат общи делители, освен единицата). Започвайки от нулевия елемент, да се изведат всички числа от кръга, придвижвайки се с K позиции на всяка итерация.
Ограничения: 2 <= N <= 1024
Вход:
На 1-вия ред на стандартния вход се въвеждат числата N и K, разделени с интервал. На следващия ред, разделени с интервал, се въвеждат N-те числа, разположени в кръг.
Изход:
На единствения ред на стандартния изход се извеждат N-те числа, подредени по гореуказания начин.
Пример:
Вход:
10 3
1 2 3 4 5 6 7 8 9 10
Изход:
1 4 7 10 3 6 9 2 5 8
________________________________________


19.	Задача Да се дефинира функция sortLex, която получава като аргументи положителното число n и масив a, съдържащ n на брой цели неотрицателни числа, и ги сортира във възходящ ред относно лексикографската наредба (например, 123 е преди 9 по лексикографската наредба).
Пример:
Вход:
{13, 14, 7, 2018, 9, 0}
Изход:
{0, 13, 14, 2018, 7, 9}

